# Name Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksetPreview..::..Name Property
WorksetPreview Class See Also
---
Name of the workset.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public string Name { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Name As String
	Get
```

Visual C++
---
```text
public:
property String^ Name {
	String^ get ();
}
```

# Remarks
Name is case-insensitive.
# See Also
WorksetPreview Class
Autodesk.Revit.DB Namespace